espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/platform/emlib/src/em_i2c.c
/*******************************************************************************
 **************************   LOCAL FUNCTIONS   *******************************
 ******************************************************************************/

/** @cond DO_NOT_INCLUDE_WITH_DOXYGEN */

/***************************************************************************//**
 * @brief
 *   Empty received data buffer.
 ******************************************************************************/
static void flushRx(I2C_TypeDef *i2c)
{
  while (i2c->STATUS & I2C_STATUS_RXDATAV) {
    i2c->RXDATA;
  }

#if defined(_SILICON_LABS_32B_SERIES_2)
  /* SW needs to clear RXDATAV IF on Series 2 devices.
     Flag is kept high by HW if buffer is not empty. */
  I2C_IntClear(i2c, I2C_IF_RXDATAV);
#endif
}

/** @endcond */

/*******************************************************************************
 **************************   GLOBAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   Get the current configured I2C bus frequency.
 *
 * @details
 *   This frequency is only relevant when acting as master.
 *
 * @note
 *   The actual frequency is a real number, this function returns a rounded
 *   down (truncated) integer value.
 *
 * @param[in] i2c
 *   A pointer to the I2C peripheral register block.
 *
 * @return
 *   The current I2C frequency in Hz.
 ******************************************************************************/
uint32_t I2C_BusFreqGet(I2C_TypeDef *i2c)
{
  uint32_t freqHfper = 0;
  uint32_t n;

  /* Maximum frequency is given by freqScl = freqHfper/((Nlow + Nhigh)(DIV + 1) + I2C_CR_MAX)
   * For more details, see the reference manual
   * I2C Clock Generation chapter. */
  if (i2c == I2C0) {
    freqHfper = CMU_ClockFreqGet(cmuClock_I2C0);
#if defined(I2C1)
  } else if (i2c == I2C1) {
    freqHfper = CMU_ClockFreqGet(cmuClock_I2C1);
#endif
#if defined(I2C2)
  } else if (i2c == I2C2) {
    freqHfper = CMU_ClockFreqGet(cmuClock_I2C2);
#endif
  } else {
    EFM_ASSERT(false);
  }

  /* n = Nlow + Nhigh */
  n = (uint32_t)i2cNSum[(i2c->CTRL & _I2C_CTRL_CLHR_MASK)
                        >> _I2C_CTRL_CLHR_SHIFT];
  return freqHfper / ((n * (i2c->CLKDIV + 1)) + I2C_CR_MAX);
}

/***************************************************************************//**
 * @brief
 *   Set the I2C bus frequency.
 *
 * @details
 *   The bus frequency is only relevant when acting as master. The bus
 *   frequency should not be set higher than the maximum frequency accepted by the
 *   slowest device on the bus.
 *
 *   Notice that, due to asymmetric requirements on low and high I2C clock
 *   cycles in the I2C specification, the maximum frequency allowed
 *   to comply with the specification may be somewhat lower than expected.
 *
 *   See the reference manual, details on I2C clock generation,
 *   for maximum allowed theoretical frequencies for different modes.
 *
 * @param[in] i2c
 *   A pointer to the I2C peripheral register block.
 *
 * @param[in] freqRef
 *   An I2C reference clock frequency in Hz that will be used. If set to 0,
 *   HFPERCLK / HFPERCCLK clock is used. Setting it to a higher than actual
 *   configured value has the consequence of reducing the real I2C frequency.
 *
 * @param[in] freqScl
 *   A bus frequency to set (bus speed may be lower due to integer
 *   prescaling). Safe (according to the I2C specification) maximum frequencies for
 *   standard fast and fast+ modes are available using I2C_FREQ_ defines.
 *   (Using I2C_FREQ_ defines requires corresponding setting of @p type.)
 *   The slowest slave device on a bus must always be considered.
 *
 * @param[in] i2cMode
 *   A clock low-to-high ratio type to use. If not using i2cClockHLRStandard,
 *   make sure all devices on the bus support the specified mode. Using a
 *   non-standard ratio is useful to achieve a higher bus clock in fast and
 *   fast+ modes.
 ******************************************************************************/
void I2C_BusFreqSet(I2C_TypeDef *i2c,
                    uint32_t freqRef,
                    uint32_t freqScl,
                    I2C_ClockHLR_TypeDef i2cMode)
{
  uint32_t n, minFreq, denominator;
  int32_t div;

  /* Avoid dividing by 0. */
  EFM_ASSERT(freqScl);
  if (!freqScl) {
    return;
  }

  /* Ensure mode is valid */
  i2cMode &= _I2C_CTRL_CLHR_MASK >> _I2C_CTRL_CLHR_SHIFT;

  /* Set the CLHR (clock low-to-high ratio). */
  i2c->CTRL &= ~_I2C_CTRL_CLHR_MASK;
  BUS_RegMaskedWrite(&i2c->CTRL,
                     _I2C_CTRL_CLHR_MASK,
                     i2cMode << _I2C_CTRL_CLHR_SHIFT);

  if (freqRef == 0) {
    if (i2c == I2C0) {
      freqRef = CMU_ClockFreqGet(cmuClock_I2C0);
#if defined(I2C1)
    } else if (i2c == I2C1) {
      freqRef = CMU_ClockFreqGet(cmuClock_I2C1);
#endif
#if defined(I2C2)
    } else if (i2c == I2C2) {
      freqRef = CMU_ClockFreqGet(cmuClock_I2C2);
#endif
    } else {
      EFM_ASSERT(false);
    }
  }

  /* Check the minumum HF peripheral clock. */
  minFreq = UINT_MAX;
  if (i2c->CTRL & I2C_CTRL_SLAVE) {
    switch (i2cMode) {
      case i2cClockHLRStandard:
#if defined(_SILICON_LABS_32B_SERIES_0)
        minFreq = 4200000; break;
#elif defined(_SILICON_LABS_32B_SERIES_1)
        minFreq = 2000000; break;
#elif defined(_SILICON_LABS_32B_SERIES_2)
        minFreq = 2000000; break;
#endif
      case i2cClockHLRAsymetric:
#if defined(_SILICON_LABS_32B_SERIES_0)
        minFreq = 11000000; break;
#elif defined(_SILICON_LABS_32B_SERIES_1)
        minFreq = 5000000; break;
#elif defined(_SILICON_LABS_32B_SERIES_2)
        minFreq = 5000000; break;
#endif
      case i2cClockHLRFast:
#if defined(_SILICON_LABS_32B_SERIES_0)
        minFreq = 24400000; break;
#elif defined(_SILICON_LABS_32B_SERIES_1)
        minFreq = 14000000; break;
#elif defined(_SILICON_LABS_32B_SERIES_2)
        minFreq = 14000000; break;
#endif
      default:
        /* MISRA requires the default case. */
        break;
    }
  } else {
    /* For master mode, platform 1 and 2 share the same
       minimum frequencies. */
    switch (i2cMode) {
      case i2cClockHLRStandard:
        minFreq = 2000000; break;
      case i2cClockHLRAsymetric:
        minFreq = 9000000; break;
      case i2cClockHLRFast:
        minFreq = 20000000; break;
      default:
        /* MISRA requires default case */
        break;
    }
  }

  /* Frequency most be larger-than. */
  EFM_ASSERT(freqRef > minFreq);

  /* SCL frequency is given by:
   * freqScl = freqRef/((Nlow + Nhigh) * (DIV + 1) + I2C_CR_MAX)
   *
   * Therefore,
   * DIV = ((freqRef - (I2C_CR_MAX * freqScl))/((Nlow + Nhigh) * freqScl)) - 1
   *
   * For more details, see the reference manual
   * I2C Clock Generation chapter.  */

  /* n = Nlow + Nhigh */
  n = (uint32_t)i2cNSum[i2cMode];
  denominator = n * freqScl;

